src/org/emergency-mode.org
#+TITLE: Emergency Mode
#+DATE: [2021-08-17 Tue 13:00]

前几天朋友机器开机出现"You are in emergency mode. After logiing in,....Give root password for maintenance"，登进去之后，按理应该type"journalctl -xb"便一目了然。但由于机器在远端，朋友告诉说上面提示"Give root password for maintenance (or type Control-D continue)"，然后就让他登录进去，进去之后。我这边尝试用普通用户远程登录，拒绝登录。便让其查看sshd进程是否开启
#+BEGIN_EXAMPLE
ps -ef | grep ssh
#+END_EXAMPLE
确实没有，然后让他启动sshd却发现没有这个目录，接着让他执行
#+BEGIN_EXAMPLE
which ssh
#+END_EXAMPLE
确实没有，原来在紧急模式下这些命令都不存在的。于是接着执行
#+BEGIN_EXAMPLE
mount -o remount rw /
#+END_EXAMPLE
这次有了，便开启sshd
#+BEGIN_EXAMPLE
/etc/init.d/ssh start
#+END_EXAMPLE
开启之后，以为这次就可以顺利登入了，结果得到如下提示：
#+BEGIN_EXAMPLE
"System is booting up. Unprivileged users are not permitted to log in yet. Please come back later. For technical details, see pam_nologin(8)."
#+END_EXAMPLE
输入,移除限制
#+BEGIN_EXAMPLE
rm /run/nologin
#+END_EXAMPLE
这次终于登录进去了。经过一番望闻问切得知，朋友昨天换过硬盘，然后通过
#+BEGIN_EXAMPLE
lsblk
#+END_EXAMPLE
查看发现并没有发现这块硬盘，那就是没有挂载上。反复尝试插拔，也没有发现，怀疑是sata接口线有问题，便大概知道什么原因了，移除/etc/fstab文件下该盘的自动挂载记录
#+BEGIN_EXAMPLE
/dev/sda /data ext4 defaults 0 0
#+END_EXAMPLE
重启，该问题消失。

